app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "applications".* FROM "applications"
INSERT INTO "user_apps" ("app_id", "user_id", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["app_id", 31], ["user_id", 17], ["position", 31], ["created_at", "2018-04-13 06:09:14.844523"], ["updated_at", "2018-04-13 06:09:14.844523"]]
SELECT "user_apps".* FROM "user_apps" WHERE "user_apps"."user_id" = ? ORDER BY postion  [["user_id", 11]]
UPDATE "users" SET "first" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first", "f"], ["updated_at", "2018-04-13 06:12:41.458725"], ["id", 18]]
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = 1 LIMIT ?  [["LIMIT", 1]]
---
  def index
    @user = User.find_by(id:current_user.id)

    if @user.first
      application = Application.all
      application.each do |a|
        if a.defaultStatus
          UserApp.create app_id: a.id, user_id: @user.id, position: a.id
        end
      end
      @user.first = false
      @user.save
    end
    @app_id = UserApp.where(user_id:current_user.id)
    @app = @app_id.sort_by{|i| i.position}.map{|i| Application.find_by(id:i.app_id)}

SELECT "applications".* FROM "applications"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "user_apps".* FROM "user_apps" WHERE "user_apps"."user_id" = ? AND "user_apps"."app_id" = ?  [["user_id", 11], ["app_id", 21]]
---
  def new
    @all = Application.all
    @unused = []
    @all.each do |a|
      if UserApp.where(user_id:current_user.id,app_id:a.id).blank?

INSERT INTO "user_apps" ("app_id", "user_id", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["app_id", 22], ["user_id", 11], ["position", 22], ["created_at", "2018-04-12 08:07:05.674772"], ["updated_at", "2018-04-12 08:07:05.674772"]]
---
  def create
    @ap = UserApp.new
    @ap.user_id = current_user.id
    @ap.app_id = params["app_id"]
    @ap.position = params["app_id"]
    @ap.save!

SELECT  "user_apps".* FROM "user_apps" WHERE "user_apps"."user_id" = ? AND "user_apps"."app_id" = ? LIMIT ?  [["user_id", 11], ["app_id", 22], ["LIMIT", 1]]
DELETE FROM "user_apps" WHERE "user_apps"."id" = ?  [["id", 7]]
---
  def destroy
    d = UserApp.find_by(user_id:current_user.id, app_id:params["app_id"])
    d.destroy

UPDATE "user_apps" SET "position" = 1 WHERE "user_apps"."app_id" = ? AND "user_apps"."user_id" = ?  [["app_id", 22], ["user_id", 11]]
---
  def sort
    params[:application].each_with_index do |id, index|
      UserApp.where(app_id: id,user_id:current_user.id).update_all(position: index+1)